a = input("введите слово: камень, ножницы или бумага")
if a not in ["ножницы" , "камень" , "бумага"]:
    print("неизветсный предмет")
    exit(1)
b = input("введите второе слово: камень, ножницы или бумагв")
if b not in ["ножницы" , "камень" , "бумага"]:
    print("неизветсный предмет")
    exit(1)

if a == "камень" and b == "ножницы":
    print("игрок 1 победил")
elif a == "камень" and b == "бумага":
    print("игрок 2 победил")
elif a == "камень" and b == "камень":
    print("ничья")
elif a == "ножницы" and b == "камень":
    print("игрок 2 победил")
elif a == "ножницы" and b == "бумага":
    print("игрок 1 победил")
elif a == "ножницы" and b == "ножницы":
    print("ничья")
elif a == "бумага" and b == "камень":
    print("игрок 1 победил")
elif a == "бумага" and b == "ножницы":
    print("игрок 2 победил")
elif a == "бумага" and b == "бумага":
    print("ничья")
    